In [20]:
import pandas as pd
adult = pd.read_csv('/Users/ecuerbo/Desktop/data/adult.csv')

In [21]:
adult_dtypes = {
    "workclass" : "category",
    "education" : "category",
    "relationship":'category',
    'marital.status':'category',
    'income':"category",
    "sex":"category"
}

adult=pd.read_csv(
    '/Users/ecuerbo/Desktop/data/adult.csv',
    dtype=adult_dtypes)
print(adult.dtypes)

age                  int64
workclass         category
fnlwgt               int64
education         category
education.num        int64
marital.status    category
occupation          object
relationship      category
race                object
sex               category
capital.gain         int64
capital.loss         int64
hours.per.week       int64
native.country      object
income            category
dtype: object

In [22]:
adult[adult["occupation"]=='Farming-fishing'][['native.country', 'sex', 'income']].value_counts()

native.country  sex     income
United-States   Male    <=50K     711
                        >50K      109
Mexico          Male    <=50K      72
United-States   Female  <=50K      57
?               Male    <=50K       5
Puerto-Rico     Male    <=50K       4
Philippines     Male    <=50K       4
Mexico          Female  <=50K       3
Guatemala       Female  <=50K       2
Vietnam         Male    <=50K       2
Canada          Male    <=50K       2
Italy           Male    <=50K       2
Cuba            Male    <=50K       2
United-States   Female  >50K        2
El-Salvador     Male    <=50K       2
Mexico          Male    >50K        2
Guatemala       Male    <=50K       2
Puerto-Rico     Female  <=50K       1
England         Male    <=50K       1
Poland          Male    <=50K       1
Portugal        Male    <=50K       1
France          Male    <=50K       1
Germany         Male    <=50K       1
Cambodia        Male    >50K        1
Japan           Male    <=50K       1
Ireland         Male    <=50K       1
Hong            Male    <=50K       1
Yugoslavia      Male    >50K        1
dtype: int64

In [23]:
adult[adult['workclass']=='Never-worked'][['sex','income','native.country']].value_counts()

sex     income  native.country
Male    <=50K   United-States     5
Female  <=50K   United-States     2
dtype: int64

In [6]:
adult.groupby(by=['income']).mean()

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
income,,,,,,
<=50K,36.783738,190340.86517,9.595065,148.752468,53.142921,38.840210
>50K,44.249841,188005.00000,11.611657,4006.142456,195.001530,45.473026

In [8]:
adult[['sex','income']].value_counts()

sex     income
Male    <=50K     15128
Female  <=50K      9592
Male    >50K       6662
Female  >50K       1179
dtype: int64

In [9]:
adult[['income','relationship']].value_counts()

income  relationship
<=50K   Not-in-family     7449
        Husband           7275
>50K    Husband           5918
<=50K   Own-child         5001
        Unmarried         3228
        Other-relative     944
>50K    Not-in-family      856
<=50K   Wife               823
>50K    Wife               745
        Unmarried          218
        Own-child           67
        Other-relative      37
dtype: int64

In [10]:
adult.shape

(32561, 15)

In [12]:
adult.values

array([[90, '?', 77053, ..., 40, 'United-States', '<=50K'],
       [82, 'Private', 132870, ..., 18, 'United-States', '<=50K'],
       [66, '?', 186061, ..., 40, 'United-States', '<=50K'],
       ...,
       [40, 'Private', 154374, ..., 40, 'United-States', '>50K'],
       [58, 'Private', 151910, ..., 40, 'United-States', '<=50K'],
       [22, 'Private', 201490, ..., 20, 'United-States', '<=50K']],
      dtype=object)

In [13]:
adult.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education.num',
       'marital.status', 'occupation', 'relationship', 'race', 'sex',
       'capital.gain', 'capital.loss', 'hours.per.week', 'native.country',
       'income'],
      dtype='object')

In [14]:
a=adult.columns.values
print(a)

['age' 'workclass' 'fnlwgt' 'education' 'education.num' 'marital.status'
 'occupation' 'relationship' 'race' 'sex' 'capital.gain' 'capital.loss'
 'hours.per.week' 'native.country' 'income']

In [15]:
adult.index

RangeIndex(start=0, stop=32561, step=1)

In [16]:
adult.sort_values('capital.loss', ascending=False)

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11859,33,Private,394447,Masters,14,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,33,United-States,>50K
11858,47,Private,121124,9th,5,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,<=50K
11857,55,Self-emp-inc,67433,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States,<=50K
11856,20,Private,277700,Preschool,1,Never-married,Other-service,Own-child,White,Male,0,0,32,United-States,<=50K
32560,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K

In [17]:
adult.sort_values(['capital.loss','hours.per.week'], ascending=[1,1])

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
4086,69,?,320280,Some-college,10,Never-married,?,Not-in-family,White,Male,1848,0,1,United-States,<=50K
4129,66,Self-emp-inc,150726,9th,5,Married-civ-spouse,Exec-managerial,Husband,White,Male,1409,0,1,?,<=50K
4396,58,State-gov,109567,Doctorate,16,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,1,United-States,>50K
5327,69,?,195779,Assoc-voc,11,Widowed,?,Not-in-family,White,Female,0,0,1,United-States,<=50K
9077,78,?,363134,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,0,1,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K

In [19]:
sub_cols=['marital.status', 'occupation','age']
adult[sub_cols]

           marital.status         occupation  age
0                 Widowed                  ?   90
1                 Widowed    Exec-managerial   82
2                 Widowed                  ?   66
3                Divorced  Machine-op-inspct   54
4               Separated     Prof-specialty   41
...                   ...                ...  ...
32556       Never-married    Protective-serv   22
32557  Married-civ-spouse       Tech-support   27
32558  Married-civ-spouse  Machine-op-inspct   40
32559             Widowed       Adm-clerical   58
32560       Never-married       Adm-clerical   22

[32561 rows x 3 columns]

In [37]:
adult[adult['education.num']>adult['education.num'].median()][['age','capital.loss']].describe()

                age  capital.loss
count  10516.000000  10516.000000
mean      40.212628    129.609833
std       11.984181    488.922203
min       18.000000      0.000000
25%       31.000000      0.000000
50%       39.000000      0.000000
75%       47.000000      0.000000
max       90.000000   3683.000000

In [40]:
adult[adult['capital.loss']>1][['age','education.num','hours.per.week']].describe()

               age  education.num  hours.per.week
count  1519.000000    1519.000000     1519.000000
mean     41.697828      10.969059       43.252798
std      12.625609       2.688426       12.247258
min      17.000000       1.000000        1.000000
25%      32.000000       9.000000       40.000000
50%      41.000000      10.000000       40.000000
75%      50.000000      13.000000       50.000000
max      90.000000      16.000000       99.000000

In [43]:
pinoy = adult[adult['native.country']=='Philippines']
pinoy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 198 entries, 95 to 32442
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             198 non-null    int64
 1   workclass       198 non-null    category
 2   fnlwgt          198 non-null    int64
 3   education       198 non-null    category
 4   education.num   198 non-null    int64
 5   marital.status  198 non-null    category
 6   occupation      198 non-null    object
 7   relationship    198 non-null    category
 8   race            198 non-null    object
 9   sex             198 non-null    category
 10  capital.gain    198 non-null    int64
 11  capital.loss    198 non-null    int64
 12  hours.per.week  198 non-null    int64
 13  native.country  198 non-null    object
 14  income          198 non-null    category
dtypes: category(6), int64(6), object(3)
memory usage: 18.4+ KB